In [1]:
import pandas as pd

help(pd)

Help on package pandas:

NAME
    pandas

DESCRIPTION
    pandas - a powerful data analysis and manipulation library for Python
    =====================================================================

    **pandas** is a Python package providing fast, flexible, and expressive data
    structures designed to make working with "relational" or "labeled" data both
    easy and intuitive. It aims to be the fundamental high-level building block for
    doing practical, **real world** data analysis in Python. Additionally, it has
    the broader goal of becoming **the most powerful and flexible open source data
    analysis / manipulation tool available in any language**. It is already well on
    its way toward this goal.

    Main Features
    -------------
    Here are just a few of the things that pandas does well:

      - Easy handling of missing data in floating point as well as non-floating
        point data.
      - Size mutability: columns can be inserted and deleted from DataFrame and
        higher dimensional objects
      - Automatic and explicit data alignment: objects can be explicitly aligned
        to a set of labels, or the user can simply ignore the labels and let
        `Series`, `DataFrame`, etc. automatically align the data for you in
        computations.
      - Powerful, flexible group by functionality to perform split-apply-combine
        operations on data sets, for both aggregating and transforming data.
      - Make it easy to convert ragged, differently-indexed data in other Python
        and NumPy data structures into DataFrame objects.
      - Intelligent label-based slicing, fancy indexing, and subsetting of large
        data sets.
      - Intuitive merging and joining data sets.
      - Flexible reshaping and pivoting of data sets.
      - Hierarchical labeling of axes (possible to have multiple labels per tick).
      - Robust IO tools for loading data from flat files (CSV and delimited),
        Excel files, databases, and saving/loading data from the ultrafast HDF5
        format.
      - Time series-specific functionality: date range generation and frequency
        conversion, moving window statistics, date shifting and lagging.

PACKAGE CONTENTS
    _config (package)
    _libs (package)
    _testing
    _typing
    _version
    api (package)
    arrays (package)
    compat (package)
    conftest
    core (package)
    errors (package)
    io (package)
    plotting (package)
    testing
    tests (package)
    tseries (package)
    util (package)

SUBMODULES
    _hashtable
    _lib
    _tslib
    offsets

FUNCTIONS
    __getattr__(name)

DATA
    IndexSlice = <pandas.core.indexing._IndexSlice object>
    NA = <NA>
    NaT = NaT
    __docformat__ = 'restructuredtext'
    __git_version__ = '2a7d3326dee660824a8433ffd01065f8ac37f7d6'
    describe_option = <pandas._config.config.CallableDynamicDoc object>
    get_option = <pandas._config.config.CallableDynamicDoc object>
    options = <pandas._config.config.DictWrapper object>
    reset_option = <pandas._config.config.CallableDynamicDoc object>
    set_option = <pandas._config.config.CallableDynamicDoc object>

VERSION
    1.1.2

FILE
    /home/suren/Documents/Otus/lessons/PythonBasic.2020-07/16.pandas/venv/lib/python3.8/site-packages/pandas/__init__.py

In [2]:
s = pd.Series(range(7, 17))
print(s)

0     7
1     8
2     9
3    10
4    11
5    12
6    13
7    14
8    15
9    16
dtype: int64

In [3]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [4]:
s.values

array([ 7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [5]:
type(s.values)

numpy.ndarray

In [6]:
data = list(range(10))
print(data)

from string import ascii_lowercase
print(ascii_lowercase)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
abcdefghijklmnopqrstuvwxyz

In [7]:
index_letters = [ascii_lowercase[i] for i in data]
print(index_letters)

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [8]:
s = pd.Series(data, index=index_letters)
s

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [9]:
print(s['a'])
print(s['g'])
print(s['j'])

0
6
9

In [10]:
s[['a', 'b', 'f', 'g']]

a    0
b    1
f    5
g    6
dtype: int64

In [11]:
s[:]

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [12]:
s is not s[:]

True

In [13]:
s[['a', 'd']] = 13
s

a    13
b     1
c     2
d    13
e     4
f     5
g     6
h     7
i     8
j     9
dtype: int64

In [14]:
s > 6

a     True
b    False
c    False
d     True
e    False
f    False
g    False
h     True
i     True
j     True
dtype: bool

In [15]:
s[s > 6] * 2

a    26
d    26
h    14
i    16
j    18
dtype: int64

In [16]:
s ** 2

a    169
b      1
c      4
d    169
e     16
f     25
g     36
h     49
i     64
j     81
dtype: int64

In [17]:
'f' in s

True

In [18]:
'i' in s

True

In [19]:
'k' in s

False

In [20]:
items = {ascii_lowercase[i]: i for i in range(10)}
print(items)

s = pd.Series(items)
print(s)

{'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9}
a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [21]:
s = pd.Series(items, index=[ascii_lowercase[i] for i in range(len(items) + 1)])

s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
i    8.0
j    9.0
k    NaN
dtype: float64

In [22]:
import numpy as np

print(np.nan)
print(np.NaN)
print(np.nan is np.NaN)

nan
nan
True

In [23]:
print(s['k'])

nan

In [24]:
s.min()

0.0

In [25]:
s.max()

9.0

In [26]:
s.median()

4.5

In [27]:
(pd.Series(items)).median()

4.5

In [28]:
s['k'] = 10
print(s)
print(s.median())

a     0.0
b     1.0
c     2.0
d     3.0
e     4.0
f     5.0
g     6.0
h     7.0
i     8.0
j     9.0
k    10.0
dtype: float64
5.0

In [29]:
s.name = 'Numbers'
s.index.name = 'letters'

s

letters
a     0.0
b     1.0
c     2.0
d     3.0
e     4.0
f     5.0
g     6.0
h     7.0
i     8.0
j     9.0
k    10.0
Name: Numbers, dtype: float64

In [30]:
s.array

<PandasArray>
[0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
Length: 11, dtype: float64

In [31]:
s.array[0]

0.0

In [32]:
s.to_numpy()

array([ 0.,  1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [33]:
s.array[[0, 3, 5]]

<PandasArray>
[0.0, 3.0, 5.0]
Length: 3, dtype: float64

In [34]:
np.exp(s)

letters
a        1.000000
b        2.718282
c        7.389056
d       20.085537
e       54.598150
f      148.413159
g      403.428793
h     1096.633158
i     2980.957987
j     8103.083928
k    22026.465795
Name: Numbers, dtype: float64

In [35]:
df = pd.DataFrame({
    'country': ['Russia', 'Kazakhstan', 'Ukraine', 'Belarus'],
    'population': [144.5, 18.3, 42.4, 9.5],
    'square': [17_250_000, 2_724_900, 603_628, 207_595],
},
    index=['RU', 'KZ', 'UA', 'BY'],
)

df

       country  population    square
RU      Russia       144.5  17250000
KZ  Kazakhstan        18.3   2724900
UA     Ukraine        42.4    603628
BY     Belarus         9.5    207595

In [36]:
df.index

Index(['RU', 'KZ', 'UA', 'BY'], dtype='object')

In [37]:
df.index.name = 'Country Code'

df.index

Index(['RU', 'KZ', 'UA', 'BY'], dtype='object', name='Country Code')

In [38]:
df

                 country  population    square
Country Code
RU                Russia       144.5  17250000
KZ            Kazakhstan        18.3   2724900
UA               Ukraine        42.4    603628
BY               Belarus         9.5    207595

In [39]:
df['country']

Country Code
RU        Russia
KZ    Kazakhstan
UA       Ukraine
BY       Belarus
Name: country, dtype: object

In [40]:
df['population']

Country Code
RU    144.5
KZ     18.3
UA     42.4
BY      9.5
Name: population, dtype: float64

In [41]:
df['population']['KZ']

18.3

In [42]:
df.loc['KZ']

country       Kazakhstan
population          18.3
square           2724900
Name: KZ, dtype: object

In [43]:
type(df.loc['KZ'])

pandas.core.series.Series

In [44]:
df.iloc[2]

country       Ukraine
population       42.4
square         603628
Name: UA, dtype: object

In [45]:
df.loc[['RU', 'BY'], 'population']

Country Code
RU    144.5
BY      9.5
Name: population, dtype: float64

In [46]:
df['population'][['RU', 'BY']]

Country Code
RU    144.5
BY      9.5
Name: population, dtype: float64

In [47]:
df.loc['RU':'UA']

                 country  population    square
Country Code
RU                Russia       144.5  17250000
KZ            Kazakhstan        18.3   2724900
UA               Ukraine        42.4    603628

In [48]:
df.loc['KZ':]

                 country  population   square
Country Code
KZ            Kazakhstan        18.3  2724900
UA               Ukraine        42.4   603628
BY               Belarus         9.5   207595

In [49]:
df.iloc[:3]

                 country  population    square
Country Code
RU                Russia       144.5  17250000
KZ            Kazakhstan        18.3   2724900
UA               Ukraine        42.4    603628

In [50]:
df.loc['KZ':, 'square']

Country Code
KZ    2724900
UA     603628
BY     207595
Name: square, dtype: int64

In [51]:
df.population

Country Code
RU    144.5
KZ     18.3
UA     42.4
BY      9.5
Name: population, dtype: float64

In [52]:
df.square

Country Code
RU    17250000
KZ     2724900
UA      603628
BY      207595
Name: square, dtype: int64

In [53]:
df.population > 40

Country Code
RU     True
KZ    False
UA     True
BY    False
Name: population, dtype: bool

In [54]:
df[df.population > 40]

              country  population    square
Country Code
RU             Russia       144.5  17250000
UA            Ukraine        42.4    603628

In [55]:
df[df.population > 40][['country', 'square']]

              country    square
Country Code
RU             Russia  17250000
UA            Ukraine    603628

In [56]:
df['density'] = df.population * 1_000_000 / df.square

df

                 country  population    square    density
Country Code
RU                Russia       144.5  17250000   8.376812
KZ            Kazakhstan        18.3   2724900   6.715843
UA               Ukraine        42.4    603628  70.241937
BY               Belarus         9.5    207595  45.762181

In [57]:
df.density

Country Code
RU     8.376812
KZ     6.715843
UA    70.241937
BY    45.762181
Name: density, dtype: float64

In [58]:
del df['density']

In [59]:
df

                 country  population    square
Country Code
RU                Russia       144.5  17250000
KZ            Kazakhstan        18.3   2724900
UA               Ukraine        42.4    603628
BY               Belarus         9.5    207595

In [60]:
df['density'] = df.population * 1_000_000 / df.square
df

                 country  population    square    density
Country Code
RU                Russia       144.5  17250000   8.376812
KZ            Kazakhstan        18.3   2724900   6.715843
UA               Ukraine        42.4    603628  70.241937
BY               Belarus         9.5    207595  45.762181

In [61]:
df.drop(['density'], axis='columns')

                 country  population    square
Country Code
RU                Russia       144.5  17250000
KZ            Kazakhstan        18.3   2724900
UA               Ukraine        42.4    603628
BY               Belarus         9.5    207595

In [62]:
countries_filename = 'countries_data.csv'
df.to_csv(countries_filename)

In [63]:
del df['density']
df.to_csv(countries_filename)

In [64]:
df = pd.read_csv(countries_filename)
df

  Country Code     country  population    square
0           RU      Russia       144.5  17250000
1           KZ  Kazakhstan        18.3   2724900
2           UA     Ukraine        42.4    603628
3           BY     Belarus         9.5    207595

In [65]:
df = pd.read_csv(countries_filename, index_col=0)
df

                 country  population    square
Country Code
RU                Russia       144.5  17250000
KZ            Kazakhstan        18.3   2724900
UA               Ukraine        42.4    603628
BY               Belarus         9.5    207595

In [66]:
df.to_numpy()

array([['Russia', 144.5, 17250000],
       ['Kazakhstan', 18.3, 2724900],
       ['Ukraine', 42.4, 603628],
       ['Belarus', 9.5, 207595]], dtype=object)

In [67]:
titanic = pd.read_csv('titanic.csv')
titanic

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...,...
1308,1309,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.00,male,0,0

In [68]:
titanic.head()

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [69]:
titanic.tail(4)

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
1309,1310,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.0,male,0,0

In [70]:
titanic.groupby(['Sex', 'Survived']).count()

                 PassengerID  Name  PClass  Age  SexCode
Sex    Survived
female 0                 154   154     154   71      154
       1                 308   308     308  217      308
male   0                 709   709     709  372      709
       1                 142   142     142   96      142

In [71]:
titanic.groupby(['Sex', 'Survived'])['PassengerID'].count()

Sex     Survived
female  0           154
        1           308
male    0           709
        1           142
Name: PassengerID, dtype: int64

In [72]:
titanic.groupby(['PClass', 'Survived'])['PassengerID'].count()

PClass  Survived
*       0             1
1st     0           129
        1           193
2nd     0           160
        1           119
3rd     0           573
        1           138
Name: PassengerID, dtype: int64

In [73]:
pvt = titanic.pivot_table(
    index=['Sex'],
    columns=['PClass'],
    values='Name',
    aggfunc='count',
)
pvt

PClass    *    1st    2nd    3rd
Sex
female  NaN  143.0  107.0  212.0
male    1.0  179.0  172.0  499.0

In [74]:
weights = pd.read_csv(
    'weights.csv',
    index_col=0,
    parse_dates=True,
)

weights

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2014-01-14,0.184660,0.275706,0.303425,0.042841,0.193368
2014-01-15,0.225875,0.147861,0.151211,0.224074,0.250978
2014-01-16,0.261017,0.334213,0.293336,0.015744,0.095690
2014-01-17,0.160168,0.231034,0.092674,0.269050,0.247074
2014-01-18,0.057162,0.254146,0.027286,0.480660,0.180746
...,...,...,...,...,...
2018-02-28,0.123821,0.167899,0.120844,0.088780,0.498657
2018-03-01,0.035043,0.289624,0.220871,0.136366,0.318096
2018-03-02,0.397155,0.362025,0.050554,0.020247,0.170019
2018-03-03,0.319902,0.277405,0.051719,0.008164,0.342810
2018-03-06,0.057699,0.352290,0.291162,0.197700,0.101148

In [75]:
weights = weights.sort_index()

weights

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2014-01-14,0.184660,0.275706,0.303425,0.042841,0.193368
2014-01-15,0.225875,0.147861,0.151211,0.224074,0.250978
2014-01-16,0.261017,0.334213,0.293336,0.015744,0.095690
2014-01-17,0.160168,0.231034,0.092674,0.269050,0.247074
2014-01-18,0.057162,0.254146,0.027286,0.480660,0.180746
...,...,...,...,...,...
2018-02-28,0.123821,0.167899,0.120844,0.088780,0.498657
2018-03-01,0.035043,0.289624,0.220871,0.136366,0.318096
2018-03-02,0.397155,0.362025,0.050554,0.020247,0.170019
2018-03-03,0.319902,0.277405,0.051719,0.008164,0.342810
2018-03-06,0.057699,0.352290,0.291162,0.197700,0.101148

In [76]:
weights['AT0000A18XM4 SW'].head()

2014-01-14    0.184660
2014-01-15    0.225875
2014-01-16    0.261017
2014-01-17    0.160168
2014-01-18    0.057162
Name: AT0000A18XM4 SW, dtype: float64

In [77]:
weights['AT0000A18XM4 SW']

2014-01-14    0.184660
2014-01-15    0.225875
2014-01-16    0.261017
2014-01-17    0.160168
2014-01-18    0.057162
                ...
2018-02-28    0.123821
2018-03-01    0.035043
2018-03-02    0.397155
2018-03-03    0.319902
2018-03-06    0.057699
Name: AT0000A18XM4 SW, Length: 1081, dtype: float64

In [78]:
weights[['AT0000A18XM4 SW', 'BE0974268972 BB']]

            AT0000A18XM4 SW  BE0974268972 BB
2014-01-14         0.184660         0.275706
2014-01-15         0.225875         0.147861
2014-01-16         0.261017         0.334213
2014-01-17         0.160168         0.231034
2014-01-18         0.057162         0.254146
...                     ...              ...
2018-02-28         0.123821         0.167899
2018-03-01         0.035043         0.289624
2018-03-02         0.397155         0.362025
2018-03-03         0.319902         0.277405
2018-03-06         0.057699         0.352290

[1081 rows x 2 columns]

In [79]:
# print(weights.to_string())

In [80]:
weights.agg(['min', 'max'])

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
min,0.000063,0.000018,0.000331,2.895741e-07,0.000132
max,0.588783,0.638583,0.792982,8.555499e-01,0.621904

In [81]:
weights.agg('sum')

AT0000A18XM4 SW    207.610076
BE0974268972 BB    219.560807
US0527691069 US    221.511034
DE0007164600 GR    217.219639
US6092071058 US    215.098445
dtype: float64

In [82]:
weights.idxmax()

AT0000A18XM4 SW   2017-05-06
BE0974268972 BB   2014-10-08
US0527691069 US   2017-08-24
DE0007164600 GR   2017-01-25
US6092071058 US   2016-06-15
dtype: datetime64[ns]

In [83]:
weights.loc[weights.idxmax()]

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2017-05-06,0.588783,0.098971,0.065059,0.220716,0.026471
2014-10-08,0.055022,0.638583,0.087784,0.004366,0.214245
2017-08-24,0.016481,0.081014,0.792982,0.034498,0.075025
2017-01-25,0.033026,0.044487,0.063948,0.855550,0.002989
2016-06-15,0.089216,0.227885,0.007397,0.053598,0.621904

In [84]:
titanic.head()

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [85]:
titanic.head(2000)

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...,...
1308,1309,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.00,male,0,0

In [86]:
import json
from datetime import datetime


with open('fines.json') as f:
    json_str = f.read()

value_raw = json.loads(json_str)['Value']
fines_list = json.loads(value_raw)['Fines']

from pprint import pprint

pprint(fines_list[0])

{'AdminOffensesTypeText': '',
 'AmountToPay': 0,
 'ApnDetail': [{'AttrId': 'StAP',
                'Name': '     ,  '
                        '',
                'Value': '12.17 .1.2 -       '
                         '      -'},
               {'AttrId': 'MestoDAP',
                'Name': '  ',
                'Value': '-,.1, () -'},
               {'AttrId': 'DatNar',
                'Name': '   ',
                'Value': '23.01.2018 00:21:00'},
               {'AttrId': 'MestoNar',
                'Name': ' ',
                'Value': ' .    .15/1'},
               {'AttrId': 'OdpsName',
                'Name': ' ,  ',
                'Value': '       .'},
               {'AttrId': 'FIONarush',
                'Name': '',
                'Value': ' '},
               {'AttrId': 'GRZNarush',
                'Name': ' ',
                'Value': '700*****'}],
 'DAP': '18810177180125209293',
 'DAPName': '   18810177180125209293  '
            '25.01.2018',
 'DateDAP': '25.01.2018',
 'DiscountDate': '',
 'DiscountSize': '',
 'DiscountSizeAmountToPaySum': None,
 'FineStatus': 1,
 'FineSum': 3000,
 'HasAdditionalActions': False,
 'HasPhoto': True,
 'IsFine': True,
 'Latitude': '55,7563209999',
 'Longitude': '37,614136',
 'OdpsKod': '1145519',
 'PayedAmountSum': None,
 'PaymentId': '',
 'Sh': '{"DAP":"18810177180125209293","DateDAP":"25.01.2018","ODPS":"  '
       '     '
       '.","PaymentID":null,"RsRschet":"40101810045250010041","SgBuk":"044525000","ShBankName":" '
       '   '
       '","ShInn":"7707089101","ShKbk":"18811630020016000140","ShKpp":"770731005","ShOkato":"45379000","ShPoluchName":" '
       ' .  (     '
       '.)","Sum":3000,"Uin":"18810177180125209293"}',
 'Sts': '7741525886',
 'Type': 0,
 'UID': 'f9e58750-5f64-4138-942a-67e0967d4547',
 'VidNak': '2',
 'VstupDate': '',
 'Vu': ''}

In [87]:
fines = []
for fine in fines_list:
    fines.append({
        'Name': fine['ApnDetail'][0]['Value'].replace('\t', ' - '),
        'Place': fine['ApnDetail'][3]['Value'],
        'Fine sum': fine['FineSum'],
    })

fines_df = pd.DataFrame.from_dict(fines)
fines_df

,Name,Place,Fine sum
0,12.17 .1.2 - ...,. .15/1,3000
1,12.09.2 - 2...,"/ -9 """", 24+750,",500
2,12.9.6 - 40-6...,. . .79,2000
3,12.15.1 - . ./ . ...,. .,1500
4,12.9.6 - 40-6...,. .36/9,2000
...,...,...,...
830,12.09.2 - 2...,. .28,500
831,"12.16.5 , 4...",". , , 4",3000
832,"12.16.5 , 4...",". , , 4",3000
833,"12.16.5 , 4...",". , . , . 2",3000
834,"12.16.5 , 4...",". , , 3",3000

In [88]:
summary = fines_df.groupby('Name')['Fine sum'].agg(
    ['count', 'sum'],
).sort_values(['count'], ascending=False)

summary

                                                    count     sum
Name
12.09.2 -      20...    361  180500
12.17 .1.2 -      ...    212  636000
12.15.1 - . ./  . ...     95  142500
12.9.6 -     40-60...     94  188000
12.15.5 -    , ...     21  105000
12.9.7 -     60-80...     17   85000
12.16.5 ,  4...     15   45000
12.16.1 -     ...      8    4000
12.09.3 -      40...      7    7000
12.19 .6 - ,     ...      3    9000
12.16.2 -      ...      1    1000
8.14.2  -     ...      1    2500

In [89]:
pd.Series(summary.sum(), name='Full summary')

count        835
sum      1405500
Name: Full summary, dtype: int64

In [90]:
summary.append(
    pd.Series(summary.sum(), name='Full summary')
)

                                                    count      sum
Name
12.09.2 -      20...    361   180500
12.17 .1.2 -      ...    212   636000
12.15.1 - . ./  . ...     95   142500
12.9.6 -     40-60...     94   188000
12.15.5 -    , ...     21   105000
12.9.7 -     60-80...     17    85000
12.16.5 ,  4...     15    45000
12.16.1 -     ...      8     4000
12.09.3 -      40...      7     7000
12.19 .6 - ,     ...      3     9000
12.16.2 -      ...      1     1000
8.14.2  -     ...      1     2500
Full summary                                          835  1405500